In [1]:
import pandas as pd

C:\Users\divya\anaconda3\Lib\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [2]:
pd.__version__

'2.2.2'

In [3]:
pip install --upgrade pandas --user

Requirement already satisfied: pandas in c:\users\divya\anaconda3\lib\site-packages (2.2.2)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: numpy>=1.23.2 in c:\users\divya\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\divya\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\divya\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: tzdata>=2022.7 in c:\users\divya\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\divya\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [4]:
pd.__version__

'2.2.2'

In [24]:
s1=pd.Series(['rakshana','shalini','prathu','divya','asmi'],index=[1,2,3,4,5])

In [25]:
print(s1)

1    rakshana
2     shalini
3      prathu
4       divya
5        asmi
dtype: object

In [26]:
s2=pd.Series([123,124,125,126,127],index=[1,2,3,4,5])

In [27]:
s2

1    123
2    124
3    125
4    126
5    127
dtype: int64

In [28]:
s3=pd.Series(['kumbakonam','thanjavur','trichy','pudhukottai','ooty'],index=[1,2,3,4,5])

In [29]:
s3

1     kumbakonam
2      thanjavur
3         trichy
4    pudhukottai
5           ooty
dtype: object

# DATA  FRAME

variable_name=pd.DataFrame(data,column=[column name])

In [30]:
df1=pd.DataFrame(s1,columns=["names"])

In [31]:
df1

      names
1  rakshana
2   shalini
3    prathu
4     divya
5      asmi

In [32]:
df1["register no"]=s2

In [33]:
df1

      names  register no
1  rakshana          123
2   shalini          124
3    prathu          125
4     divya          126
5      asmi          127

In [34]:
df1["native"]=s3

In [35]:
df1

      names  register no       native
1  rakshana          123   kumbakonam
2   shalini          124    thanjavur
3    prathu          125       trichy
4     divya          126  pudhukottai
5      asmi          127         ooty

# df2

In [36]:
fruits={"seed":{1:"orange",2:"apple",3:"guava"},"seedless":{1:"grapes",2:"papaya",3:"pine apple"}}

In [37]:
fruits

{'seed': {1: 'orange', 2: 'apple', 3: 'guava'},
 'seedless': {1: 'grapes', 2: 'papaya', 3: 'pine apple'}}

In [38]:
df2=pd.DataFrame(fruits,columns=["seed","seedless"])

In [39]:
df2

     seed    seedless
1  orange      grapes
2   apple      papaya
3   guava  pine apple

# activity 1

In [48]:
department={"name":{1:"rakshana",2:"shalini",3:"prathu",4:"divya",5:"asmi",6:"harini",7:"sindhiya",8:"salma",9:"jayanthi",10:"moushi"},"register number":{1:123,2:124,3:124,4:125,5:126,6:345,7:456,8:234,9:987,10:765},"year of study":{1:3,2:4,3:3,4:2,5:3,6:3,7:4,8:2,9:3,10:4}}

In [49]:
department

{'name': {1: 'rakshana',
  2: 'shalini',
  3: 'prathu',
  4: 'divya',
  5: 'asmi',
  6: 'harini',
  7: 'sindhiya',
  8: 'salma',
  9: 'jayanthi',
  10: 'moushi'},
 'register number': {1: 123,
  2: 124,
  3: 124,
  4: 125,
  5: 126,
  6: 345,
  7: 456,
  8: 234,
  9: 987,
  10: 765},
 'year of study': {1: 3,
  2: 4,
  3: 3,
  4: 2,
  5: 3,
  6: 3,
  7: 4,
  8: 2,
  9: 3,
  10: 4}}

In [50]:
df3=pd.DataFrame(department,columns=["name","register number","year of study"])

In [51]:
df3

        name  register number  year of study
1   rakshana              123              3
2    shalini              124              4
3     prathu              124              3
4      divya              125              2
5       asmi              126              3
6     harini              345              3
7   sindhiya              456              4
8      salma              234              2
9   jayanthi              987              3
10    moushi              765              4

In [52]:
Name=df3["name"]

In [53]:
Name

1     rakshana
2      shalini
3       prathu
4        divya
5         asmi
6       harini
7     sindhiya
8        salma
9     jayanthi
10      moushi
Name: name, dtype: object

In [54]:
df3.drop(5,axis=0)

        name  register number  year of study
1   rakshana              123              3
2    shalini              124              4
3     prathu              124              3
4      divya              125              2
6     harini              345              3
7   sindhiya              456              4
8      salma              234              2
9   jayanthi              987              3
10    moushi              765              4

In [55]:
df3.drop("register number",axis=1)

        name  year of study
1   rakshana              3
2    shalini              4
3     prathu              3
4      divya              2
5       asmi              3
6     harini              3
7   sindhiya              4
8      salma              2
9   jayanthi              3
10    moushi              4